#1. Реализовать функцию, принимающую два числа
# (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации
# деления на ноль.

def f():
   chisel_1 = int(input("введите первую переменную:"))
   chisel_2 = int(input("введите вторую переменную:"))
   peremen = chisel_1 / chisel_2
   if chisel_2 == 0:
    print("ошибка")
   else:
       return peremen
print(f())

#2. Реализовать функцию, принимающую несколько параметров,
# описывающих данные пользователя: имя, фамилия, год рождения,
# город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

def my_func(name, surname, year, city, email, telephone):
    return ' '.join([name, surname, year, city, email, telephone])
print(my_func(surname=input("введите фамилию:"),
              name=input("введите имя:"),
              year=input("введите год рождения:"),
              city=input("введите город проживания:"),
              email=input("введите почту:"),
              telephone=input("введите телефон:")))

#3. Реализовать функцию my_func(), которая принимает три позиционных аргумента,
# и возвращает сумму наибольших двух аргументов.

def my_func(x, y, z):
    my_list = [x, y, z]
    new = []
    max_1 = max(my_list)
    new.append(max_1)
    my_list.remove(max_1)
    max_2 = max(my_list)
    new.append(max_2)
    print(sum(new))
my_func(int(input("введите 1 число:")),
        int(input("введите 2 число:")),
        int(input("введите 3 число:")))

#4. Программа принимает действительное положительное число x и целое отрицательное число y.
#Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
#При решении задания необходимо обойтись без встроенной функции возведения числа в степень'''

def my_func(x, y):
    return 1 / x ** abs(y)
    #return x ** y
print(my_func(int(input("введите положительное число:")),
        int(input("введите отрицательное число:"))))

#5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
#При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод
# чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел
# будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится
# специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого
# завершить программу.

def my_sum ():
    itog_result = 0
    exit = False
    while exit == False:
        chisla = input('Введите числа через пробел или Q для выхода: ').split()
        summa = 0
        for el in range(len(chisla)):
            if chisla[el] == 'q' or chisla[el] == 'Q':
                exit = True
                break
            else:
                summa = summa + int(chisla[el])
        itog_result = itog_result + summa
        print(itog_result)
    print(itog_result)

#6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и
# возвращающую его же, но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
#Продолжить работу над заданием. В программу должна попадать строка из слов,
# разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().

def int_func():
    word = input("Введите слова через пробел:")
    print(word.title())
    return
int_func()